ror_bookstore/app/controllers/api/v1/authors_controller.rb

SELECT "authors".* FROM "authors"
---
      def index
        authors = Author.all