ror_bookstore/app/controllers/api/v1/books_controller.rb

      def index
        books = Book.includes(:author, :publisher, :genre).all
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10)
SELECT "books".* FROM "books"
SELECT "genres".* FROM "genres" WHERE "genres"."id" IN (2, 3, 1, 4, 5)
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" IN (1, 2, 3, 4, 5)