ror_bookstore/app/controllers/api/v1/books_controller.rb

      def index
        books = Book.includes(:author, :publisher, :genre).all
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" IN ($1, $2, $3)  [["id", 8], ["id", 9], ["id", 10]]
SELECT "books".* FROM "books"
SELECT "genres".* FROM "genres" WHERE "genres"."id" IN ($1, $2, $3)  [["id", 8], ["id", 9], ["id", 10]]
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" IN ($1, $2, $3)  [["id", 8], ["id", 9], ["id", 10]]

      def show
        book = Book.includes(:author, :publisher, :genre).find(params[:id])
---
SELECT "authors".* FROM "authors" WHERE "authors"."id" = $1  [["id", 11]]
SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "genres".* FROM "genres" WHERE "genres"."id" = $1  [["id", 11]]
SELECT "publishers".* FROM "publishers" WHERE "publishers"."id" = $1  [["id", 11]]