ror_bookstore/app/controllers/api/v1/genres_controller.rb

      def index
        genres = Genre.all
---
SELECT "genres".* FROM "genres"