ror_bookstore/app/controllers/api/v1/publishers_controller.rb

      def index
        publishers = Publisher.all
---
SELECT "publishers".* FROM "publishers"