ror_bookstore/app/controllers/api/v1/admin/books_controller.rb

INSERT INTO "books" ("author_id", "created_at", "description", "genre_id", "name", "price", "publisher_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
        def create
          book = Book.new(book_params)
          authorize book
          book.save!

UPDATE "books" SET "name" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["name", "Updated"], ["updated_at", "2026-05-13 02:04:48.985769"], ["id", 38]]
---
        def update
          authorize @book
          @book.update!(book_params)

DELETE FROM "books" WHERE "books"."id" = $1  [["id", 51]]
---
        def destroy
          authorize @book
          @book.destroy!