ror_bookstore/app/controllers/api/v1/admin/books_controller.rb

UPDATE "books" SET "description" = 'A horror novel about the Torrance family. Oh yeah', "updated_at" = '2026-05-13 03:03:44.756134' WHERE "books"."id" = 7
---
        def update
          authorize @book
          @book.update!(book_params)

SELECT "books".* FROM "books" WHERE "books"."id" = 7 LIMIT 1
---
        def set_book
          @book = Book.find(params[:id])